Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Password storage and hashing
ja_jp: パスワードの保存とハッシュ化

source: Password: `admin`
ja_jp: パスワード: `admin`

source: Password: `alice`
ja_jp: パスわ=ド: `alice`

source: Path Parameters
ja_jp: パスパラメーター

source: Path Specific Authentication Mechanism
ja_jp: パス固有認証メカニズム

source: Path considerations
ja_jp: パスの考慮事項

source: Path of TLS KeyStore.
ja_jp: TLS KeyStore のパス。

source: Path of TLS TrustStore.
ja_jp: TLS TrustStoreのパス。

source: Path parameter values are always strings. If the path parameter is not present in the path, the `WebSocketConnection#pathParam(String)`/`WebSocketClientConnection#pathParam(String)` method returns `null`. If there is an endpoint callback method parameter annotated with `@PathParam` and the parameter name is not defined in the endpoint path, then the build fails.
ja_jp: パスパラメーターの値は常に文字列です。 パス内にパスパラメーターが存在しない場合、 `WebSocketConnection#pathParam(String)`/`WebSocketClientConnection#pathParam(String)` メソッドは `null` を返します。 `@PathParam` アノテーションが付けられたエンドポイントコールバックメソッドパラメーターがあり、パラメーター名がエンドポイントパスで定義されていない場合、ビルドは失敗します。

source: Path parameters
ja_jp: パスパラメーター

source: Path resolution in Quarkus
ja_jp: Quarkusでのパス解決

source: Path to TLS trusted certificate which may need to be configured if the keys have to be fetched over `HTTPS`.
ja_jp: キーを `HTTPS` 経由でフェッチする必要がある場合は、TLS の信頼できる証明書へのパスを設定する必要があります。

source: Path to TLS trusted certificate which might need to be configured if the keys have to be fetched over `HTTPS`.
ja_jp: 鍵を `HTTPS` 経由で取得する必要がある場合に設定する必要がある可能性のある TLS 信頼済み証明書へのパス。

source: Path to a JWT bearer token. Quarkus loads a new token from the file system and reloads it when the token expires.
ja_jp: JWT ベアラートークンへのパス。Quarkus はファイルシステムから新しいトークンをロードし、トークンの有効期限が切れると再ロードします。

source: Path to a JWT bearer token. Quarkus loads a new token from the filesystem and reloads it when the token expires.
ja_jp: JWT ベアラートークンへのパスです。 Quarkus はファイルシステムから新しいトークンを読み込み、トークンの有効期限が切れると再読み込みします。

source: Path to a JWT bearer token. Quarkus loads a new token from a filesystem and reload it when the token has expired.
ja_jp: JWT ベアラートークンへのパス。Quarkus はファイルシステムから新しいトークンをロードし、トークンの有効期限が切れると再ロードします。

source: Path to a JWT bearer token. Quarkus loads a new token from a filesystem and reloads it when the token has expired.
ja_jp: JWT ベアラートークンへのパス。Quarkus はファイルシステムから新しいトークンをロードし、トークンの有効期限が切れると再ロードします。

source: Path to the TLS certificate file.
ja_jp: TLS証明書ファイルへのパス。

source: Path to the TLS key file.
ja_jp: TLSキーファイルへのパス。

source: Path to the claim containing the groups. It starts from the top level JSON object and can contain multiple segments where each segment represents a JSON object name only, example: `realm/groups`. This property can be used if a token has no 'groups' claim but has the groups set in a different claim. Use double quotes with the namespace qualified claims.
ja_jp: グループを含むクレームへのパス。これはトップレベルの JSON オブジェクトから始まり、複数のセグメントを含めることができます。各セグメントは JSON オブジェクト名のみを表します (例: `realm/groups`)。このプロパティーは、トークンに 'groups' クレームがないが、グループが別のクレームに設定されている場合に使用できます。namespace で修飾されたクレームには二重引用符を使用します。

source: Path to the claim containing the groups. It starts from the top-level JSON object and can contain multiple segments where each segment represents a JSON object name only, for example: `realm/groups`. This property can be used if a token has no 'groups' claim but has the groups set in a different claim. Use double quotes with the namespace-qualified claims.
ja_jp: グループを含むクレームへのパス。これは最上位の JSON オブジェクトから始まり、各セグメントが JSON オブジェクト名のみを表す複数のセグメントを含めることができます (例: `レルム/groups`)。このプロパティーは、トークンに 'groups' クレームがなく、別のクレームにグループが設定されている場合に使用できます。名前空間修飾クレームには二重引用符を使用します。

source: Path to the claim containing the subject name. It starts from the top level JSON object and can contain multiple segments where each segment represents a JSON object name only, example: `realms/subject`. This property can be used if a token has no 'sub' claim but has the subject set in a different claim. Use double quotes with the namespace qualified claims.
ja_jp: 件名を含むクレームへのパス。これはトップレベルの JSON オブジェクトから始まり、複数のセグメントを含めることができます。各セグメントは JSON オブジェクト名のみを表します (例: `realms/subject`)。このプロパティーは、トークンに sub クレームがないが、サブジェクトが別のクレームに設定されている場合に使用できます。namespace で修飾されたクレームには二重引用符を使用します。

source: Path to the claim containing the subject name. It starts from the top-level JSON object and can contain multiple segments where each segment only represents a JSON object name, for example, `realms/subject`. This property can be used if a token has no 'sub' claim but has the subject set in a different claim. Use double quotes with the namespace-qualified claims.
ja_jp: 件名を含むクレームへのパス。これは最上位の JSON オブジェクトから始まり、各セグメントが JSON オブジェクト名のみを表す複数のセグメントを含めることができます (例: `レルム s/subject`)。このプロパティーは、トークンに 'sub' クレームがなく、サブジェクトが別のクレームに設定されている場合に使用できます。名前空間修飾クレームには二重引用符を使用します。

source: Path to the trusted TLS certificate file.
ja_jp: 信頼するTLS証明書ファイルへのパス。

source: Path values
ja_jp: パス値

source: Path-based authentication
ja_jp: パスベースの認証

source: Path-matching mechanism works exactly same as in the xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[Authorization using configuration].
ja_jp: パス一致メカニズムは、xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[設定を使用した認可] とまったく同じように動作します。

source: Path-specific authentication mechanisms
ja_jp: パス固有認証メカニズム

source: Paths are tricky business. Keep the following in mind:
ja_jp: パスというのは厄介なものです。以下の点に注意してください。

source: Pausable Channels
ja_jp: 一時停止可能なチャネル

source: Pausable channels provide a mechanism to control message flow programmatically. This is useful in scenarios where producers or consumers need to stop temporarily due to managing the lifecycle or performing maintenance operations.
ja_jp: 一時停止可能なチャネルは、メッセージフローをプログラムで制御するメカニズムを提供します。 これは、ライフサイクルの管理やメンテナンス操作の実行のために、プロデューサーまたはコンシューマーが一時的に停止する必要がある場合に役立ちます。

source: Pause a specific scheduled method by its identity
ja_jp: スケジュールされた特定のメソッドをそのIDで一時停止する

source: Pause all triggers.
ja_jp: すべてのトリガーを一時停止します。

source: Payload can be wrapped inside `org.eclipse.microprofile.reactive.messaging.Message` to have more control on the written records:
ja_jp: ペイロードを `org.eclipse.microprofile.reactive.messaging.Message` 内にラップして、書き込まれたレコードをより詳細に制御できます。

source: Pedigree
ja_jp: 系譜（Pedigree）

source: Pedigree is a way to provide information that certain patches, or changes in general, have been applied to a certain component.
ja_jp: 系譜は、特定のパッチ、または一般的な変更が特定のコンポーネントに適用されたという情報を提供するために使用されます。

source: Peeking at the streams
ja_jp: ストリームを覗く

source: Pem Key format support
ja_jp: Pem Keyフォーマットサポート

source: Per channel metrics can also be gathered and exposed as Micrometer meters. Following metrics can be gathered per channel, identified with the _channel_ tag:
ja_jp: チャネルごとのメトリクスも収集され、Micrometer メーターとして公開できます。 _チャネル_ タグで識別されるチャネルごとに、次のメトリクスを収集できます。

source: Per project, by using the system property `quarkus.analytics.disabled=true` when building the project.
ja_jp: プロジェクトごとに、プロジェクト構築時にシステムプロパティ `quarkus.analytics.disabled=true` を使用

source: Per the CDI specification, the `Instance.Handle.close()` method always delegates to `destroy()`. In ArC, this is only true in the <<strict_mode>>.
ja_jp: CDI 仕様によれば、 `Instance.Handle.close()` メソッドは常に `destroy()` に委任します。 ArC では、これは <<strict_mode>> では True のみです。

source: Per-channel configuration routes each topic to the correct ID handler
ja_jp: チャネルごとの設定が各トピックを正しい ID ハンドラーにルーティングすること

source: Per-class Exception Mapper
ja_jp: クラスごとの例外マッパー

source: Per-service override support
ja_jp: サービスごとのオーバーライドをサポート

source: Perform a full text query on books author name
ja_jp: 書籍の著者名の全文クエリを実行します。

source: Perform additional calls with numbers of your choice.
ja_jp: 好みの数字で追加問い合わせします。

source: Perform the call with the altered client. The original client remains unmodified
ja_jp: 変更したクライアントで呼び出しを行います。オリジナルのクライアントは変更されないままです。

source: Perform the logout by removing the session cookie.
ja_jp: セッション Cookie を削除してログアウトを実行します。

source: Perform your logic in `connectedCallback`, then remove the element if no longer needed.
ja_jp: `connectedCallback` でロジックを実行し、不要になったら要素を削除します。

source: Performance & Efficiency
ja_jp: 性能と効率

source: Performance Characteristics
ja_jp: パフォーマンス特性

source: Performance implications
ja_jp: パフォーマンスへの影響

source: Performance is important to Quarkus, but our published performance graphics were outdated and missing important information (such the fact that we have fantastic throughput). To fix that, we built a new benchmark that is transparent, reproducible, and measures the full performance picture. In our experiments, Quarkus can handle 2.7 times more transactions per second than Spring Boot, as well as starting 2.3 times faster, all in half the memory.
ja_jp: Quarkusにとってパフォーマンスは重要ですが、公開されていたパフォーマンスに関するグラフィックは古く、重要な情報（私たちが素晴らしいスループットを持っているという事実など）が欠けていました。これを解決するために、私たちは透明性があり、再現可能で、パフォーマンスの全体像を測定する新しいベンチマークを作成しました。私たちの実験では、QuarkusはSpring Bootよりも1秒あたり2.7倍多くのトランザクションを処理でき、2.3倍速く起動し、メモリは半分しか消費しません。

source: Performance optimizations based on real-world usage
ja_jp: 実世界の利用状況に基づいたパフォーマンスの最適化

source: Performance tuning for large messages
ja_jp: 大容量メッセージのパフォーマンスチューニング

source: Performers are needed for the following roles:
ja_jp: 以下の役柄で出演者を募集しています。

source: Perhaps the most important reason why dev mode applications should not be run in production is that the dev mode allows reading information that could be confidential (via the Dev-UI) while also giving access to operations that could be destructive (either by exposing endpoints that should not be available in production application or via the Dev-UI).
ja_jp: dev-modeアプリケーションを本番環境で実行してはいけない最も重要な理由は、開発モードでは (Dev-UI を介して) 機密性のある情報を読み取ることができる一方で、(本番環境のアプリケーションでは利用できないはずのエンドポイントを公開したり、Dev-UI を介して) 破壊的な操作にアクセスすることができるからです。

source: Perhaps the most important reason why dev-mode applications should not be run in production is that the dev-mode allows reading information that could be confidential (via the Dev-UI) while also giving access to operations that could be destructive (either by exposing endpoints that should not be available in production application or via the Dev-UI).
ja_jp: dev-modeアプリケーションを本番環境で実行してはいけない最も重要な理由は、dev-modeでは（Dev-UIを介して）機密性のある情報を読み取ることができる一方で、（本番環境のアプリケーションでは利用できないはずのエンドポイントを公開したり、Dev-UIを介して）破壊的な操作にアクセスすることができるからです。

source: Perhaps you just want to create a small self-contained CRUD application without compromising in modern web GUI technologies? We have seen how to achieve this with https://quarkus.io/blog/quarkus-and-web-ui-development-mode/[Angular] but what about React which at least according to GitHub stars has surpassed Angular in terms of popularity? It is all about choice and I will show you how you can not only integrate React but also use a web component framework called https://www.patternfly.org/[Patternfly]. Patternfly is a collection of patterns, components and styles for creating rich, consistent and interactive GUIs.
ja_jp: 最新のWeb GUI技術に妥協することなく、自己完結型の小さなCRUDアプリケーションを作りたいと思っているのではないでしょうか？ link:https://quarkus.io/blog/quarkus-and-web-ui-development-mode/[Angular]でこれを実現する方法を見てきましたが、少なくともGitHubの星の数において、人気の点でAngularを上回っているReactはどうでしょうか？今回は、Reactを統合するだけでなく、 link:https://www.patternfly.org/[Patternfly]と呼ばれるWebコンポーネントフレームワークを使用する方法を紹介します。Patternflyは、リッチで一貫性のあるインタラクティブなGUIを作成するためのパターン、コンポーネント、スタイルを集めたものです。

source: Periodic reloading
ja_jp: 定期的なリロード

source: Permission Based Access Control
ja_jp: 権限ベースのアクセス制御

source: Permission annotation
ja_jp: 権限アノテーション

source: Permission checker methods can be declared on a normal scoped CDI bean or on a `@Singleton` bean. The `@Dependent` CDI bean scope is currently not supported.
ja_jp: 権限チェッカーメソッドは、通常のスコープの CDI Bean または `@Singleton` Bean で宣言できます。 `@Dependent` CDI Bean スコープは現在サポートされていません。

source: Permission checks run by default on event loops. Annotate a permission checker method with the `io.smallrye.common.annotation.Blocking` annotation if you want to run the check on a worker thread.
ja_jp: 権限チェックは、イベントループでデフォルトで実行されます。 ワーカースレッドでチェックを実行する場合は、権限チェッカーメソッドに `io.smallrye.common.annotation.Blocking` アノテーションを付けます。

source: Permission paths and HTTP root path
ja_jp: 権限パスとHTTPルートパス

source: Permission paths and http root path
ja_jp: パーミッションパスとhttp rootパス

source: Permission sets are defined in `application.properties` as follows:
ja_jp: パーミッションセットは、 `application.properties` に以下のように定義されています:

source: Permission sets can also specify paths and methods as a comma separated list. If a path ends with `*` then it is considered to be a wildcard match and will match all sub paths, otherwise it is an exact match and will only match that specific path:
ja_jp: パーミッションセットでは、パスとメソッドをカンマ区切りのリストで指定することもできます。パスの末尾が `*` である場合はワイルドカードマッチとみなされ、すべてのサブパスにマッチしますが、そうでない場合は完全一致となり、特定のパスにのみマッチします。

source: Permission sets can also specify paths and methods as a comma-separated list. If a path ends with the `*` wildcard, the query it generates matches all sub-paths. Otherwise, it queries for an exact match and only matches that specific path:
ja_jp: 権限セットでは、パスとメソッドをコンマ区切りのリストとして指定することもできます。 パスが `*` ワイルドカードで終わる場合、生成されるクエリーはすべてのサブパスにマッチします。 それ以外の場合は、完全一致を照会し、特定のパスにのみマッチします。

source: Permissions `create`, `update`, and `read` are mapped to the role `admin`.
ja_jp: 権限 `create`、 `update`、および `read` は、ロール `admin` にマップされます。

source: Permissions are defined in config using permission sets. These are arbitrarily named permission grouping. Each permission set must specify a policy that is used to control access. There are three built-in policies: `deny`, `permit` and `authenticated`, which respectively permits all, denies all and only allows authenticated users.
ja_jp: パーミッションは、パーミッションセットを使ってコンフィグで定義されます。これらは任意の名前のパーミッション・グルーピングです。各パーミッションセットには、アクセスを制御するためのポリシーを指定する必要があります。組み込みのポリシーには， `deny` ， `permit` ， `authenticated` の3種類があり，それぞれ，すべてを許可，すべてを拒否，認証されたユーザのみを許可 となります。

source: Permissions are defined in the Quarkus configuration by permission sets, each specifying a policy for access control.
ja_jp: 権限は、Quarkus 設定で権限セットによって定義されます。各権限セットで、アクセス制御用のポリシーを指定します。

source: Permissions are defined in the Quarkus configuration using permission sets, with each permission set specifying a policy for access control.
ja_jp: Quarkusの設定では、パーミッション・セットを使用してパーミッションが定義され、各パーミッション・セットはアクセス制御のポリシーを指定します。

source: Permissions are not beans, therefore the only way to obtain bean instances is programmatically by using `Arc.container()`.
ja_jp: 権限は Bean ではないため、Bean インスタンスを取得する唯一の方法は、 `Arc.container()` を使用してプログラム的に取得することです。

source: Permissions can be disabled at build time with an `enabled` property for each declared permission, for example:
ja_jp: パーミッションは、宣言されたパーミッションごとの `enabled` プロパティを使って、ビルド時に無効にすることができます。:

source: Permissions can be disabled at build time with an `enabled` property for each declared permission, such as:
ja_jp: 権限は、宣言された各権限の `enabled` プロパティを使って、ビルド時に次のように無効にすることができます:

source: Permissions can be reenabled at runtime with a system property or environment variable, such as: `-Dquarkus.http.auth.permission.permit1.enabled=true`.
ja_jp: 権限は、システムプロパティや環境変数を使って実行時に再有効化することができます（例えば、以下のように）: `-Dquarkus.http.auth.permission.permit1.enabled=true` .

source: Permit access to the endpoint only if it is confirmed that both `mTLS` and `Basic` authentication mechanisms have authenticated the current request.
ja_jp: `mTLS` と `Basic` の両方の認証メカニズムが現在のリクエストを認証したことが確認された場合にのみ、エンドポイントへのアクセスを許可します。

source: Persist the entity into the database in a Hibernate Reactive transaction.
ja_jp: Hibernate Reactive トランザクションでエンティティーをデータベースに永続化します。

source: Persist the entity. It returns a `Uni<Fruit>`.
ja_jp: エンティティーを永続化します。これは `Uni<Fruit>` を返します。

source: Persist the payload and send the entity to Kafka.
ja_jp: ペイロードを永続化し、エンティティーを Kafka に送信します。

source: Persist the payload.
ja_jp: ペイロードを永続化させます。

source: Persist the received `fruit` object.
ja_jp: 受信した `fruit` オブジェクトを永続化します。

source: Persist the task in database using xref:hibernate-orm-panache.adoc[Panache].
ja_jp: link:hibernate-orm-panache.html[Panache]を使ってタスクをデータベースに永続化

source: Persisted only in production mode; otherwise, stored in memory.
ja_jp: 本番モードでのみ保持され、それ以外の場合はメモリーに保存されます。

source: Persistence layer for Infinispan
ja_jp: Infinispan永続化レイヤー

source: Persistence units defined in `persistence.xml` always use the xref:datasource.adoc#configure-a-single-datasource[default datasource].
ja_jp: `persistence.xml` で定義された永続化ユニットは、常に xref:datasource.adoc#configure-a-single-datasource[デフォルトのデータソース] を使用します。

source: Persistence units defined in `persistence.xml` must be configured explicitly: Quarkus will keep injection of environment-related configuration to a minimum.
ja_jp: `persistence.xml` で定義された永続化ユニットは明示的に設定する必要があります。 Quarkus は環境関連の設定の注入を最小限に抑えます。

source: Persisting Kafka messages with Hibernate Reactive
ja_jp: Hibernate Reactive を使用した Kafka メッセージの永続化

source: Persisting Kafka messages with Hibernate with Panache
ja_jp: Hibernate with Panache での Kafka メッセージの永続化

source: Phase
ja_jp: フェーズ

source: Phase name
ja_jp: フェーズ名

source: Pick a project name and click on `CREATE`.
ja_jp: プロジェクト名を選択し、 `CREATE` をクリックします。

source: Pick the approach that fits your needs. Besides, most of Quarkus services are also available using a programmatic approach, as we have seen for configuration. So, if you prefer avoiding managed objects, feel free just to use the available APIs.
ja_jp: ニーズに合ったアプローチを選びましょう。また、設定について見てきたように、Quarkusのサービスのほとんどは、プログラム的なアプローチを使用して利用することもできます。管理されたオブジェクトを避けたい場合は、利用可能なAPIを使用してください。

source: Piecing together an OpenAPI service
ja_jp: OpenAPIサービスを組み立てる

source: Ping messages are optional and not sent by default. However, server and client endpoints can be configured to automatically send ping messages on an interval.
ja_jp: ping メッセージはオプションであり、デフォルトでは送信されません。ただし、サーバーおよびクライアントのエンドポイントは、一定の間隔で ping メッセージを自動的に送信するように設定できます。

source: Ping/Pong messages
ja_jp: Ping/Pong メッセージ

source: Pinned memory refers to buffers that cannot be recycled due to active references, preventing reuse by the allocator. A _high_ number may indicate some kind of leak (as reference are not released).
ja_jp: 固定メモリとは、アクティブな参照があるためリサイクルできず、アロケーターによる再利用を妨げるバッファーを指します。 _多い_ 数は、何らかのリーク (参照が解放されていないため) を示している可能性があります。

source: Pinning cases
ja_jp: ピニングの場合

source: Pipelining
ja_jp: パイプライン

source: Pitfalls with Reactive Programming
ja_jp: リアクティブプログラミングの落とし穴

source: Placeholders
ja_jp: プレースホルダー

source: Plain variable
ja_jp: 素の変数

source: Platform
ja_jp: プラットフォーム

source: Platform Dev Services
ja_jp: プラットフォームDev Services

source: Platform Specific Memory Reporting
ja_jp: プラットフォーム固有のメモリレポート

source: Platform codestarts data
ja_jp: プラットフォームのコードスタートデータ

source: Platform component upgrades
ja_jp: プラットフォームコンポーネントのアップグレード

source: Platform differences
ja_jp: プラットフォームの差異

source: Platform resolution fix
ja_jp: Platform 解決の修正

source: Platform thread
ja_jp: プラットフォームスレッド

source: Platform updates
ja_jp: プラットフォームの更新

source: Platforms and Streams: a new way to discover Quarkus extensions
ja_jp: プラットフォームとストリーム：Quarkusエクステンションを発見する新しい方法

source: Playbook run
ja_jp: Playbookの実行

source: Please also check out https://quarkus.io/blog/quarkus-1-13-5-final-released/[the 1.13.5 announcement]
ja_jp: また、 link:https://quarkus.io/blog/quarkus-1-13-5-final-released/[1.13.5のアナウンス]もご覧ください。

source: Please also note that the `resource-config.json` file will be overwritten by Quarkus if placed directly under `src/main/resources/META-INF/native-image/` as Quarkus generates its own configuration file in this directory.
ja_jp: また、Quarkus はこのディレクトリーに独自の設定ファイルを生成するため、`src/main/resources/META-INF/native-image/` に配置すると、`resource-config.json` ファイルは Quarkus によって上書きされることにも注意してください。

source: Please also note that the `resources-config.json` file will be overwritten by Quarkus if placed directly under `src/main/resources/META-INF/native-image/` as Quarkus generates its own configuration file in this directory.
ja_jp: また、Quarkusはこのディレクトリに独自の設定ファイルを生成するため、 `src/main/resources/META-INF/native-image/` の直下に置くと、 `resources-config.json` ファイルはQuarkusによって上書きされることに注意してください。

source: Please also read xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] guide if you need to protect your applications using Bearer Token Authorization.
ja_jp: ベアラートークン認証を使用してアプリケーションを保護する必要がある場合は、 xref:security-oidc-bearer-token-authentication.adoc[OIDCベアラートークン] 認証ガイドもお読みください。

source: Please also read xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide if you need to protect your applications using Bearer Token Authorization.
ja_jp: ベアラートークン認証を使用してアプリケーションを保護する必要がある場合は、xref:security-openid-connect.adoc[OpenID Connect を使用した、サービスアプリケーションの保護] ガイドもお読みください。

source: Please also review the xref:security-proactive-authentication.adoc#cdi-request-context-activation[Activating the CDI request context] section of the "Proactive authentication" guide.
ja_jp: 「プロアクティブ認証」ガイドの xref:security-proactive-authentication.adoc#cdi-request-context-activation[CDI リクエスト・コンテキストのアクティブ化] セクションも参照してください。

source: Please also see the <<add-smallrye-jwt, How to Add SmallRye JWT directly>> section about using `JWTParser` without the `HTTP` support provided by `quarkus-smallrye-jwt`.
ja_jp: <<add-smallrye-jwt, SmallRye JWT を直接追加する方法>> セクションで、 `quarkus-smallrye-jwt` によって提供される `HTTP` サポートなしで `JWTParser` を使用する方法についても参照してください。

source: Please also see the <<add-smallrye-jwt,How to Add SmallRye JWT directly>> section about using `JWTParser` without the `HTTP` support provided by `quarkus-smallrye-jwt`.
ja_jp: `quarkus-smallrye-jwt` で提供される `HTTP` サポートなしで `JWTParser` を使用する方法については、<<add-smallrye-jwt,How to Add SmallRye JWT directly>> セクションも参照してください。

source: Please also see the <<integration-testing-keycloak-devservices, Dev Services for Keycloak>> section below about writing the integration tests which depend on `Dev Services for Keycloak`.
ja_jp: また、 `Dev Services for Keycloak` に依存する統合テストの書き方については、以下の <<integration-testing-keycloak-devservices, Dev Services for Keycloak>> セクションを参照してください。

source: Please also see the <<references>> for more information.
ja_jp: 詳細は <<references>> も参照してください。

source: Please also see the xref:add-smallrye-jwt[How to Add SmallRye JWT directly] section about using `JWTParser` without the `HTTP` support provided by `quarkus-smallrye-jwt`.
ja_jp: また、 `quarkus-smallrye-jwt` が提供する `HTTP` サポート無しで `JWTParser` を使用する方法については、SmallRye xref:add-smallrye-jwt[JWT を直接追加する方法] を参照してください。

source: Please also see xref:security-openid-connect-client.adoc[OpenID Connect Client and Token Propagation Quickstart].
ja_jp: xref:security-openid-connect-client.adoc[OpenID Connect Clientとトークン伝搬クイックスタート] も参照してください。

source: Please also see xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties] section.
ja_jp: xref:security-testing.adoc#configuring-user-information[application.propertiesでのユーザー情報の設定] セクションも参照してください。

source: Please also see xref:security-testing.adoc#testing-security[TestingSecurity Annotation] section on how to disable the security checks using `TestSecurity` annotation.
ja_jp: また、 `TestSecurity` アノテーションを使ってセキュリティチェックを無効にする方法については、 link:security-testing.html#testing-security[TestingSecurity Annotation]の項を参照してください。

source: Please check if implementing SPAs the way it is suggested in the xref:security-openid-connect.adoc#single-page-applications[Single Page Applications for Service Applications] section can meet your requirements.
ja_jp: xref:security-openid-connect.adoc#single-page-applications[サービスアプリケーションのシングルページアプリケーション] セクションで提案されている方法で SPA を実装することが要件を満たすことができるかどうかを確認してください。
